Repository: Mbyron26/ImageOverlayRenewal
Catalog: ImageOverlayRenewal/Properties/Localize.*.resx
Languages: de, it, ko, nl, pt_br, ru, zh_cn, zh_tw

# ControlPanel_ApplyOpacity
source: Apply opacity
de: Deckkraft anwenden
it: Applica opacità
ko: 투명도 적용
nl: Opaciteit toepassen
pt_br: Aplicar opacidade
ru: Применить непрозрачность
zh_cn: 应用不透明度
zh_tw: 應用不透明度

# ControlPanel_Custom
source: Custom
de: Benutzerdefiniert
it: Personalizzato
ko: 사용자 정의
nl: Aangepast
pt_br: Personalizado
ru: Настраиваемый
zh_cn: 自定义
zh_tw: 風俗

# ControlPanel_Image
source: Image
de: Grafik
it: Immagine
ko: 이미지
nl: Afbeelding
pt_br: Imagem
ru: Изображение
zh_cn: 图像
zh_tw: 圖像

# ControlPanel_No
source: No
de: Nein
ko: 아니요
nl: Nee
pt_br: Não
ru: Нет
zh_cn: 否
zh_tw: 不

# ControlPanel_NoPNG
source: No PNG images were detected in the specified directory, the specified directory can be found in Options Panel of this mod.
de: Im angegebenen Verzeichnis wurden keine PNG Bilder erkannt, das angegebene Verzeichnis kann in den Optionen dieses Mods gefunden werden.
it: Non sono state rilevate immagini PNG nella directory specificata, la directory specificata può essere trovata nel Pannello Opzioni di questa mod.
ko: 지정된 경로에 PNG 이미지가 존재하지 않습니다. 지정된 경로는 이 모드의 설정 패널에서 확인해주세요.
nl: Er werden geen PNG-afbeeldingen gedetecteerd in de opgegeven map, de opgegeven map is te vinden in de opties van deze mod.
pt_br: Não foram detetadas imagens do tipo PNG neste diretório especificado, o diretório especificado pode ser encontrado no Painel de Opções deste mod.
ru: PNG-изображения не были обнаружены в указанном каталоге, каталог можно найти на Панели настроек этого мода.
zh_cn: 未在指定的文件夹中检测到PNG图像，可以在该模组的选项面板中找到指定的文件夹。
zh_tw: 在指定的目錄中未檢測到PNG圖像，可以在此mod的選項面板中找到指定的目錄。

# ControlPanel_Opacity
source: Opacity
pt_br: Opacidade
zh_cn: 透明度
zh_tw: 透明度

# ControlPanel_Position
source: Position
it: Posizione
ko: 위치
nl: Positie
pt_br: Posição
ru: Положение
zh_cn: 位置
zh_tw: 位置

# ControlPanel_ReloadTexture
source: Reload texture
de: Textur neu laden
it: Ricarica textures
ko: 텍스처 다시 불러오기
nl: Herlaad textuur
pt_br: Recarregar texturas
ru: Перезагрузить текстуру
zh_cn: 刷新文件夹并载入新纹理
zh_tw: 重新加載紋理

# ControlPanel_Reset
source: Reset to default parameters.
de: Auf Standardparameter zurücksetzen.
it: Reimposta ai valori predefiniti.
ko: 기본값으로 초기화
nl: Resetten naar standaardwaarden.
pt_br: Redefinir para os valores padrão.
ru: Сброс к параметрам по умолчанию.
zh_cn: 重置为默认值。
zh_tw: 重置為默認參數。

# ControlPanel_Rotation
source: Rotation
de: Drehung
it: Rotazione
ko: 회전
nl: Rotatie
pt_br: Rotação
ru: Поворот
zh_cn: 旋转
zh_tw: 迴轉

# ControlPanel_ScrollWheel
source: Scroll the wheel to change, Shift X10, Ctrl X0.1
de: Zum Ändern das Mausrad drehen, Shift X10, Strg X0,1
it: Utilizza la rotellina per cambiare Shift X10, Ctrl X0.1
ko: 수정하려면 마우스 휠을 스크롤 하세요. Shift키 X10배, Ctrl키 X0.1배
nl: Scrol het muiswiel om te veranderen, Shift x10, Ctrl x0,1
pt_br: Role a roda para mudar, Shift X10, Ctrl X0.1
ru: Крутите колесо мыши для изменения, Shift X10, Ctrl X0.1
zh_cn: 使用滚轮改变参数，按住 Shift 键 ×10，按住 Ctrl 键 ×0.1
zh_tw: 滾動方向盤更換，移動x10，ctrl x0.1

# ControlPanel_SelectedImageWarning
source: When selected an image, the image pixel information needs to be loaded, and loading time depends on the number of pixels of image.
de: Wenn ein Bild ausgewählt wird, müssen die Bildpixelinformationen geladen werden, und die Ladezeit hängt von der Anzahl der Bildpixel ab.
it: Quando viene selezionata un'immagine, le informazioni sui pixel dell'immagine devono essere caricate e il tempo di caricamento dipende dal numero di pixel dell'immagine.
ko: 이미지를 선택하면 이미지 크기에 따라 픽셀 정보를 불러오는데 다소 시간이 소요될 수 있습니다.
nl: Wanneer een afbeelding wordt geselecteerd, moet de pixelinformatie worden geladen en de laadtijd hangt af van het aantal pixels in de afbeelding.
pt_br: Quando selecionada uma imagem, a informação dos pixéis da imagem precisam de ser carregados, e o tempo de carregamento depende do número de pixéis da imagem.
ru: При выборе изображения необходимо загрузить информацию о пикселях изображения, и время загрузки зависит от количества пикселей.
zh_cn: 当选择图像时，需要时间来加载图像像素信息，加载时间取决于图像的像素数量。
zh_tw: 選擇圖像時，需要加載圖像像素信息，加載時間取決於圖像的像素數量。

# ControlPanel_ShowImage
source: Show image
de: Grafik anzeigen
it: Mostra immagine
ko: 이미지 표시
nl: Afbeelding weergeven
pt_br: Mostrar imagem
ru: Показать изображение
zh_cn: 显示图像
zh_tw: 顯示圖像

# ControlPanel_SideLength
source: Side length
de: Seitenlänge
it: Lunghezza lato
ko: 측면 길이
nl: Lengte zijkant
pt_br: Comprimento do lado
ru: Длина стороны
zh_cn: 图像边长
zh_tw: 側長

# ControlPanel_Size
source: Size
de: Größe
it: Dimensione
ko: 크기
nl: Grootte
pt_br: Tamanho
ru: Размер
zh_cn: 大小
zh_tw: 尺寸

# ControlPanel_Yes
source: Yes
de: Ja
it: Si
ko: 예
nl: Ja
pt_br: Sim
ru: Да
zh_cn: 是
zh_tw: 是的

source: Load Settings
de: Einstellungen laden
it: Carica Impostazioni
ko: 설정 불러오기
nl: Instellingen laden
pt_br: Carregar Definições
ru: Загрузка настроек
zh_cn: 载入设置
zh_tw: 加載設置

# MOD_Description
source: Overlay images on top of the map, allowing you to replicate real city.
de: Überlagere die Bilder oben auf der Karte, was dir erlaubt, eine echte Stadt zu replizieren.
it: Sovrapponi le immagini sulla mappa, permettendoti di replicare la vera città.
ko: 지도 위에 이미지를 오버레이하여 실제 도시를 재현할 수 있습니다!
nl: Leg afbeeldingen op de kaart, zodat je een echte stad kunt nabootsen.
pt_br: Sobrepor imagens em cima do mapa, permitindo que repliques uma cidade real.
ru: Наложение изображений поверх карты, позволяет воссоздать реальный город.
zh_cn: 在地面覆盖图像，帮助您复刻真实的城市。
zh_tw: 在地圖頂部疊加圖像，使您可以復制真實的城市。

# OptionPanel_OpenPNGDirectory
source: Open PNG directory
de: PNG Verzeichnis öffnen
it: Apri directory PNG
ko: PNG 파일 경로 열기
nl: Open PNG map
pt_br: Abrir diretório do PNG
ru: Открыть папку с PNG
zh_cn: 打开PNG图像文件夹
zh_tw: 打開PNG目錄

# OptionPanel_PNGFilePath
source: PNG file path
de: PNG Dateipfad
it: Percorso file PNG
ko: PNG 파일 경로
nl: PNG bestandspad
pt_br: Caminho do ficheiro PNG
ru: Путь к файлу PNG
zh_cn: PNG文件所在路径
zh_tw: PNG文件路徑

# OptionPanel_PNGOptions
source: PNG Options
de: PNG Einstellungen
it: Opzioni PNG
ko: PNG 설정
nl: PNG-instellingen
pt_br: Opções do PNG
ru: Параметры PNG
zh_cn: PNG 图像选项
zh_tw: PNG選項

# OptionPanel_ShowControlPanel
source: Show control panel
de: Kontrollleiste anzeigen
it: Mostra pannello di controllo
ko: 제어판 보기
nl: Bedieningsbalk weergeven
pt_br: Mostrar o painel de controlo
ru: Показать панель управления
zh_cn: 显示控制面板
zh_tw: 顯示控制面板

# OptionPanel_ShowReloadResults
source: Always show reload texture results
de: Texturergebnisse immer anzeigen
it: Mostra sempre i risultati di ricarica delle texture
ko: 텍스처 다시 불러오기 결과 창 항상 표시
nl: Toon altijd textuurresultaten
pt_br: Mostrar sempre os resultados de recarga de texturas
ru: Всегда показывать результат перезагрузки текстуры
zh_cn: 始终显示加载新纹理的结果
zh_tw: 始終顯示重新加載紋理結果

# ReloadError
source: Make sure the PNG file is properly placed.
nl: Zorg ervoor dat het PNG-bestand correct geplaatst is.
pt_br: Verifica se o ficheiro PNG está devidamente localizado.
zh_cn: 请确保 PNG 文件放置在正确的文件夹里。

# ReloadMessageBox_NoMatching
source: No matching PNG files found.
de: Keine übereinstimmenden PNG Dateien gefunden.
it: Nessun file PNG corrispondente trovato.
ko: 일치하는 PNG 파일을 찾을 수 없습니다.
nl: Geen overeenkomende PNG bestanden gevonden.
pt_br: Não foram encontrados ficheiros PNG correspondentes.
ru: Подходящие PNG-файлы не найдены.
zh_cn: 未找到匹配的 PNG 文件。
zh_tw: 找不到匹配的PNG文件。

# ReloadMessageBox_Reload0Texture
source: Reload {0} texture:
de: Textur {0} neu laden:
it: Ricarica {0} texture:
ko: 다음 {0}개의 텍스처 다시 불러오기:
nl: Herlaad {0} textuur:
pt_br: Recarregar a textura {0}:
ru: Перезагрузить {0} текстуру:
zh_cn: 载入了{0}个纹理：
zh_tw: 重新加載{0}紋理：

# ResetWarning
source: Are you sure you want to reset to the default parameters?
pt_br: Tens a certeza que queres redefinir para os parâmetros padrão?
zh_cn: 你确定要重置为默认参数吗？

# UpdateLog_V1_8_3ADD1
source: [ADD]Added UUI button to invoke control panel.
de: [ADD]UUI Knopf zum Aufrufen des Bedienfelds hinzugefügt.
ko: [ADD]제어판을 호출하는 UUI 버튼을 추가했습니다.
ru: [ADD]Добавлена кнопка UUI для открытия панели управления.
zh_cn: [ADD]新增了 UUI 按钮，点击其可以打开控制面板。

# UpdateLog_V1_8_3ADD2
source: [ADD]Added advanced option for reset mod config.
ko: [ADD]모드 설정을 초기화하는 고급 옵션을 추가했습니다.
ru: [ADD]Добавлена расширенная опция для сброса настроек мода.
zh_cn: [ADD]添加了重置模组配置的高级选项。

# UpdateLog_V1_8_3FIX
source: [FIX]Fixed an issue with control panel background texture not displaying correctly.
de: [FIX]Es wurde ein Problem behoben, bei dem die Hintergrundtextur des Bedienfelds nicht korrekt angezeigt wurde.
ko: [FIX]제어판 배경 텍스처가 올바르게 보이지 않는 문제를 수정했습니다.
ru: [FIX]Исправлена проблема с неправильным отображением фона на панели управления.
zh_cn: [FIX]修复了控制面板的背景纹理显示不正确的问题。

# UpdateLog_V1_8_3FIX1
source: [FIX]Fixed exception thrown when there is no file.
de: [FIX]Fehler behoben, der ausgelöst wird, wenn keine Datei vorhanden ist.
ko: [FIX]파일이 존재하지 않을 때 발생하는 예외처리 문제를 수정했습니다.
ru: [FIX]Исправлена ошибка при отсутствии файла.
zh_cn: [FIX]修复了没有文件时会抛出异常信息的问题。

# UpdateLog_V1_8_3UPT
source: [UPT]Updated option panel UI style.
de: [UPT]UI Optionsleistenstil aktualisiert.
ko: [UPT]설정 패널 UI 스타일을 변경했습니다.
ru: [UPT]Обновлен стиль UI панели опций.
zh_cn: [UPT]更新了选项面板的 UI 风格。

# UpdateLog_V1_8_4TRA0
source: Added Dutch translation.
nl: Nederlandse vertaling toegevoegd.
pt_br: Adicionada tradução para holandês.
zh_cn: 新增了荷兰语翻译。

# UpdateLog_V1_8_4TRA1
source: Added Korean translation.
nl: Koreaanse vertaling toegevoegd.
pt_br: Adicionada tradução para coreano.
zh_cn: 新增了韩语翻译。

# UpdateLog_V1_8_4UPT
source: Updated to the latest common framework.
nl: Bijgewerkt naar het nieuwste gemeenschappelijke framework.
pt_br: Atualizado para a última framework comum.
zh_cn: 更新到最新的通用框架。

# UpdateLog_V1_8_5FIX0
source: Fixed an issue where placing PNG files after loading the game would not display images.
pt_br: Corrigido um problema onde ao colocar ficheiros PNG após os carregar, o jogo não mostrava as imagens.
zh_cn: 修复了在加载游戏后放置PNG文件不会显示图像的问题。

# UpdateLog_V1_8_5FIX1
source: Fixed an issue with incorrect PNG folder directory in the option panel under OSX system.
pt_br: Corrigido um problema com o diretório de pastas PNG incorreto no painel de opções no sistema OSX.
zh_cn: 修复了 OSX 系统下选项面板的 PNG 文件夹目录不正确的问题。

# UpdateLog_V1_8_5UPT0
source: Updated to support game version 1.17.1
pt_br: Suporte para a versão do jogo 1.17.1 atualizada
zh_cn: 更新支持游戏版本 1.17.1

# UpdateLog_V1_8_5UPT1
source: UUI button and separate tool button are now optional.
pt_br: Botão da UUI e botão da ferramenta separada são agora opcionais.
zh_cn: 现在可以选择模组面板按钮的显示位置：仅在 UUI 内显示 / 仅在游戏内单独显示 / 同时在 UUI 和游戏内显示。
